NVIDIA/OpenSMA/src/boards/et816/board/pin_mux.h
/*
 * Copyright 2025, NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define PCR_IBE_ibe1 0x01u /*!<@brief Input Buffer Enable: Enables */
#define PCR_PE_pe1 0x01u   /*!<@brief Pull Enable: Enables */
#define PCR_PS_ps0 0x00u   /*!<@brief Pull Select: Enables internal pulldown resistor */

/*! @name PORT0_4 (coord B14), MCU_MUX_SEL
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_MUX_SEL_GPIO GPIO0               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_MUX_SEL_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_MUX_SEL_GPIO_PIN 4U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_MUX_SEL_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_MUX_SEL_PORT PORT0               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_MUX_SEL_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_MUX_SEL_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORT0_5 (coord A14), AP_GOOD
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_AP_GOOD_GPIO GPIO0               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_AP_GOOD_GPIO_PIN 5U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_AP_GOOD_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_AP_GOOD_PORT PORT0               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_AP_GOOD_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_AP_GOOD_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORT2_1 (coord H1), S_BOOT_CMPLT_CXA
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_BOOT_CMPLT0_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_BOOT_CMPLT0_GPIO_PIN 1U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_BOOT_CMPLT0_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_BOOT_CMPLT0_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_BOOT_CMPLT0_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_BOOT_CMPLT0_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORT2_3 (coord J3), S_BOOT_CMPLT_CXB
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_BOOT_CMPLT1_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_BOOT_CMPLT1_GPIO_PIN 3U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_BOOT_CMPLT1_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_BOOT_CMPLT1_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_BOOT_CMPLT1_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_BOOT_CMPLT1_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORT0_2 (coord B16), L_MCU_P0_2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_STRAP_GPIO GPIO0               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_STRAP_GPIO_PIN 2U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_STRAP_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_STRAP_PORT PORT0               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_STRAP_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_STRAP_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORT3_10 (coord F17), MCU_GPIO
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_MCU_GPIO_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_MCU_GPIO_GPIO_PIN 10U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_MCU_GPIO_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_MCU_GPIO_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_MCU_GPIO_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_MCU_GPIO_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
